---
kind: property
id: P:Autodesk.Revit.DB.CurveExtents.StartParameter
source: html/b64e4caf-c1e1-8adc-d95a-09e9acc36eda.htm
---
# Autodesk.Revit.DB.CurveExtents.StartParameter Property

The start parameter of the curve extents.

## Syntax (C#)
```csharp
public double StartParameter { get; }
```